Repository: timpyorke/anchan-factory
Catalog: anchan/Resources/*.lproj/Localizable.strings
Languages: th

source: Settings
th: ตั้งค่า

source: Setting
th: ตั้งค่า

source: Appearance
th: การแสดงผล

source: Theme
th: ธีม

source: System
th: ระบบ

source: Light
th: สว่าง

source: Dark
th: มืด

source: Language
th: ภาษา

source: Restart required to apply language change
th: ต้องรีสตาร์ทแอปเพื่อใช้ภาษาใหม่

source: Restart Required
th: ต้องรีสตาร์ท

source: Please restart the app to apply the language change.
th: กรุณารีสตาร์ทแอปเพื่อใช้ภาษาใหม่

source: Custom Units
th: หน่วยกำหนดเอง

source: Add Custom Unit
th: เพิ่มหน่วยกำหนดเอง

source: Add custom measurement units for your inventory
th: เพิ่มหน่วยวัดสำหรับสินค้าคงคลัง

source: Symbol (e.g., cup, tbsp)
th: สัญลักษณ์ (เช่น ถ้วย, ช้อนโต๊ะ)

source: Name (e.g., Cup, Tablespoon)
th: ชื่อ (เช่น ถ้วยตวง, ช้อนโต๊ะ)

source: Unit Details
th: รายละเอียดหน่วย

source: Symbol will be displayed in uppercase
th: สัญลักษณ์จะแสดงเป็นตัวพิมพ์ใหญ่

source: Export
th: ส่งออก

source: Export Manufacturing Data
th: ส่งออกข้อมูลการผลิต

source: Export Inventory Data
th: ส่งออกข้อมูลสินค้าคงคลัง

source: Export Recipe Data
th: ส่งออกข้อมูลสูตร

source: Export data as CSV for Google Sheets or Excel
th: ส่งออกข้อมูลเป็น CSV สำหรับ Google Sheets หรือ Excel

source: Data Management
th: จัดการข้อมูล

source: Clear All Data
th: ลบข้อมูลทั้งหมด

source: Permanently delete all app data
th: ลบข้อมูลแอปทั้งหมดอย่างถาวร

source: This will delete all recipes, inventory, and manufacturing data. This action cannot be undone.
th: การดำเนินการนี้จะลบสูตร, สินค้าคงคลัง และข้อมูลการผลิตทั้งหมด ไม่สามารถยกเลิกได้

source: Clear
th: ลบ

source: Cancel
th: ยกเลิก

source: Save
th: บันทึก

source: OK
th: ตกลง

source: Delete
th: ลบ

source: Done
th: เสร็จสิ้น

source: Add
th: เพิ่ม

source: Edit
th: แก้ไข

source: Favorite
th: ชื่นชอบ

source: Unfavorite
th: ยกเลิกชื่นชอบ

source: Home
th: หน้าแรก

source: Manufacturing
th: การผลิต

source: Recipe
th: สูตร

source: Inventory
th: สินค้าคงคลัง

source: New Manufacturing
th: เริ่มผลิตใหม่

source: Select a recipe to start
th: เลือกสูตรเพื่อเริ่มต้น

source: In Progress
th: กำลังดำเนินการ

source: Recently Completed
th: เสร็จสิ้นล่าสุด

source: No Manufacturing Yet
th: ยังไม่มีการผลิต

source: Tap the button above to start manufacturing a recipe
th: แตะปุ่มด้านบนเพื่อเริ่มผลิตสูตร

source: Low Stock
th: สินค้าใกล้หมด

source: View All
th: ดูทั้งหมด

source: Restock
th: เติมสต็อก

source: Insufficient Inventory
th: วัตถุดิบไม่เพียงพอ

source: Start Anyway
th: เริ่มต้นต่อไป

source: The following ingredients don't have enough stock:
th: วัตถุดิบต่อไปนี้มีสต็อกไม่เพียงพอ:

source: See All
th: ดูทั้งหมด

source: Recipes
th: สูตรอาหาร

source: New Recipe
th: สูตรใหม่

source: Edit Recipe
th: แก้ไขสูตร

source: Recipe Name
th: ชื่อสูตร

source: Category (optional)
th: หมวดหมู่ (ไม่บังคับ)

source: Notes (optional)
th: บันทึก (ไม่บังคับ)

source: Basic Info
th: ข้อมูลพื้นฐาน

source: Batch Output
th: ผลผลิตต่อชุด

source: Batch Size
th: ขนาดชุด

source: How many units does one batch of this recipe produce?
th: สูตรนี้ผลิตได้กี่หน่วยต่อชุด?

source: Ingredients
th: วัตถุดิบ

source: Add Ingredient
th: เพิ่มวัตถุดิบ

source: Steps
th: ขั้นตอน

source: Add Step
th: เพิ่มขั้นตอน

source: Estimated Cost
th: ต้นทุนโดยประมาณ

source: Total Time
th: เวลาทั้งหมด

source: Delete Recipe
th: ลบสูตร

source: Are you sure you want to delete this recipe? This action cannot be undone.
th: คุณแน่ใจหรือไม่ว่าต้องการลบสูตรนี้? ไม่สามารถยกเลิกได้

source: No Recipes
th: ไม่มีสูตร

source: Add your first recipe to get started.
th: เพิ่มสูตรแรกของคุณเพื่อเริ่มต้น

source: Add Recipe
th: เพิ่มสูตร

source: Search recipes
th: ค้นหาสูตร

source: No ingredients added
th: ยังไม่ได้เพิ่มวัตถุดิบ

source: No steps added
th: ยังไม่ได้เพิ่มขั้นตอน

source: Recipe Not Found
th: ไม่พบสูตร

source: Are you sure you want to delete this recipe?
th: คุณแน่ใจหรือไม่ว่าต้องการลบสูตรนี้?

source: Batch Cost
th: ต้นทุนต่อชุด

source: Cost per %@
th: ต้นทุนต่อ %@

source: Select Recipe
th: เลือกสูตร

source: Create a recipe first to start manufacturing
th: สร้างสูตรก่อนเพื่อเริ่มผลิต

source: %@ ingredient%@ insufficient
th: วัตถุดิบ %@ รายการ%@ไม่เพียงพอ

source: %@ ingredient%@ with insufficient stock
th: วัตถุดิบ %@ รายการ%@มีสต็อกไม่เพียงพอ

source: Stock: %@ %@
th: สต็อก: %@ %@

source: Notes
th: บันทึก

source: New Item
th: รายการใหม่

source: Edit Item
th: แก้ไขรายการ

source: Item Details
th: รายละเอียดรายการ

source: Name
th: ชื่อ

source: Unit & Pricing
th: หน่วย & ราคา

source: Unit
th: หน่วย

source: Current stock
th: สต็อกปัจจุบัน

source: Restock Alert
th: แจ้งเตือนเติมสต็อก

source: Minimum stock
th: สต็อกขั้นต่ำ

source: Get notified when stock falls below this level
th: รับการแจ้งเตือนเมื่อสต็อกต่ำกว่าระดับนี้

source: Delete Item
th: ลบรายการ

source: No Items
th: ไม่มีรายการ

source: Add your first inventory item to get started.
th: เพิ่มรายการสินค้าคงคลังแรกของคุณเพื่อเริ่มต้น

source: Add Item
th: เพิ่มรายการ

source: Search inventory
th: ค้นหาสินค้าคงคลัง

source: Price per %@
th: ราคาต่อ %@

source: Grams (g)
th: กรัม (g)

source: Kilograms (kg)
th: กิโลกรัม (kg)

source: Milliliters (ml)
th: มิลลิลิตร (ml)

source: Liters (l)
th: ลิตร (l)

source: Pieces (pcs)
th: ชิ้น (pcs)

source: Batch Number
th: หมายเลขชุด

source: Batch
th: ชุด

source: Batches
th: จำนวนชุด

source: Total Units
th: จำนวนหน่วยทั้งหมด

source: Total Cost
th: ต้นทุนรวม

source: Cost per Unit
th: ต้นทุนต่อหน่วย

source: Completed
th: เสร็จสิ้น

source: Step
th: ขั้นตอน

source: Step %@ of %@
th: ขั้นตอน %@ จาก %@

source: Complete Step
th: เสร็จสิ้นขั้นตอน

source: Manufacturing Complete!
th: การผลิตเสร็จสิ้น!

source: All steps have been completed successfully.
th: ขั้นตอนทั้งหมดเสร็จสมบูรณ์

source: Cancel Manufacturing
th: ยกเลิกการผลิต

source: Are you sure you want to cancel this manufacturing process?
th: คุณแน่ใจหรือไม่ว่าต้องการยกเลิกการผลิตนี้?

source: Continue
th: ดำเนินการต่อ

source: Not Found
th: ไม่พบ

source: Ingredients Needed
th: วัตถุดิบที่ต้องการ

source: %@ low
th: เหลือน้อย %@ รายการ

source: Next Step
th: ขั้นตอนถัดไป

source: Complete Manufacturing
th: เสร็จสิ้นการผลิต

source: Unit (e.g., pcs, bottles)
th: หน่วย (เช่น ชิ้น, ขวด)

source: Inventory Item
th: รายการสินค้าคงคลัง

source: No inventory items available
th: ไม่มีรายการสินค้าคงคลัง

source: Select Item
th: เลือกรายการ

source: Select an item
th: เลือกรายการ

source: Amount
th: จำนวน

source: Quantity
th: ปริมาณ

source: Note (optional)
th: บันทึก (ไม่บังคับ)

source: Additional Info
th: ข้อมูลเพิ่มเติม

source: Step Info
th: ข้อมูลขั้นตอน

source: Step Title
th: ชื่อขั้นตอน

source: Description (optional)
th: รายละเอียด (ไม่บังคับ)

source: Time
th: เวลา

source: Duration
th: ระยะเวลา

source: steps
th: ขั้นตอน

source: ingredient
th: วัตถุดิบ

source: ingredients
th: วัตถุดิบ
